bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_fpga_reg.h
/* 0x6DC : rf_fpga_table_47 */
#define RF_FPGA_TABLE_47_OFFSET (0x6DC)
#define RF_FPGA_SDMIN_47        RF_FPGA_SDMIN_47
#define RF_FPGA_SDMIN_47_POS    (0U)
#define RF_FPGA_SDMIN_47_LEN    (30U)
#define RF_FPGA_SDMIN_47_MSK    (((1U << RF_FPGA_SDMIN_47_LEN) - 1) << RF_FPGA_SDMIN_47_POS)
#define RF_FPGA_SDMIN_47_UMSK   (~(((1U << RF_FPGA_SDMIN_47_LEN) - 1) << RF_FPGA_SDMIN_47_POS))

/* 0x6E0 : rf_fpga_table_48 */
#define RF_FPGA_TABLE_48_OFFSET (0x6E0)
#define RF_FPGA_FREQ_CW_3       RF_FPGA_FREQ_CW_3
#define RF_FPGA_FREQ_CW_3_POS   (0U)
#define RF_FPGA_FREQ_CW_3_LEN   (7U)
#define RF_FPGA_FREQ_CW_3_MSK   (((1U << RF_FPGA_FREQ_CW_3_LEN) - 1) << RF_FPGA_FREQ_CW_3_POS)
#define RF_FPGA_FREQ_CW_3_UMSK  (~(((1U << RF_FPGA_FREQ_CW_3_LEN) - 1) << RF_FPGA_FREQ_CW_3_POS))
#define RF_FPGA_FREQ_CW_2       RF_FPGA_FREQ_CW_2
#define RF_FPGA_FREQ_CW_2_POS   (8U)
#define RF_FPGA_FREQ_CW_2_LEN   (7U)
#define RF_FPGA_FREQ_CW_2_MSK   (((1U << RF_FPGA_FREQ_CW_2_LEN) - 1) << RF_FPGA_FREQ_CW_2_POS)
#define RF_FPGA_FREQ_CW_2_UMSK  (~(((1U << RF_FPGA_FREQ_CW_2_LEN) - 1) << RF_FPGA_FREQ_CW_2_POS))
#define RF_FPGA_FREQ_CW_1       RF_FPGA_FREQ_CW_1
#define RF_FPGA_FREQ_CW_1_POS   (16U)
#define RF_FPGA_FREQ_CW_1_LEN   (7U)
#define RF_FPGA_FREQ_CW_1_MSK   (((1U << RF_FPGA_FREQ_CW_1_LEN) - 1) << RF_FPGA_FREQ_CW_1_POS)
#define RF_FPGA_FREQ_CW_1_UMSK  (~(((1U << RF_FPGA_FREQ_CW_1_LEN) - 1) << RF_FPGA_FREQ_CW_1_POS))
#define RF_FPGA_FREQ_CW_0       RF_FPGA_FREQ_CW_0
#define RF_FPGA_FREQ_CW_0_POS   (24U)
#define RF_FPGA_FREQ_CW_0_LEN   (7U)
#define RF_FPGA_FREQ_CW_0_MSK   (((1U << RF_FPGA_FREQ_CW_0_LEN) - 1) << RF_FPGA_FREQ_CW_0_POS)
#define RF_FPGA_FREQ_CW_0_UMSK  (~(((1U << RF_FPGA_FREQ_CW_0_LEN) - 1) << RF_FPGA_FREQ_CW_0_POS))

/* 0x6E4 : rf_fpga_table_49 */
#define RF_FPGA_TABLE_49_OFFSET (0x6E4)
#define RF_FPGA_FREQ_CW_7       RF_FPGA_FREQ_CW_7
#define RF_FPGA_FREQ_CW_7_POS   (0U)
#define RF_FPGA_FREQ_CW_7_LEN   (7U)
#define RF_FPGA_FREQ_CW_7_MSK   (((1U << RF_FPGA_FREQ_CW_7_LEN) - 1) << RF_FPGA_FREQ_CW_7_POS)
#define RF_FPGA_FREQ_CW_7_UMSK  (~(((1U << RF_FPGA_FREQ_CW_7_LEN) - 1) << RF_FPGA_FREQ_CW_7_POS))
#define RF_FPGA_FREQ_CW_6       RF_FPGA_FREQ_CW_6
#define RF_FPGA_FREQ_CW_6_POS   (8U)
#define RF_FPGA_FREQ_CW_6_LEN   (7U)
#define RF_FPGA_FREQ_CW_6_MSK   (((1U << RF_FPGA_FREQ_CW_6_LEN) - 1) << RF_FPGA_FREQ_CW_6_POS)
#define RF_FPGA_FREQ_CW_6_UMSK  (~(((1U << RF_FPGA_FREQ_CW_6_LEN) - 1) << RF_FPGA_FREQ_CW_6_POS))
#define RF_FPGA_FREQ_CW_5       RF_FPGA_FREQ_CW_5
#define RF_FPGA_FREQ_CW_5_POS   (16U)
#define RF_FPGA_FREQ_CW_5_LEN   (7U)
#define RF_FPGA_FREQ_CW_5_MSK   (((1U << RF_FPGA_FREQ_CW_5_LEN) - 1) << RF_FPGA_FREQ_CW_5_POS)
#define RF_FPGA_FREQ_CW_5_UMSK  (~(((1U << RF_FPGA_FREQ_CW_5_LEN) - 1) << RF_FPGA_FREQ_CW_5_POS))
#define RF_FPGA_FREQ_CW_4       RF_FPGA_FREQ_CW_4
#define RF_FPGA_FREQ_CW_4_POS   (24U)
#define RF_FPGA_FREQ_CW_4_LEN   (7U)
#define RF_FPGA_FREQ_CW_4_MSK   (((1U << RF_FPGA_FREQ_CW_4_LEN) - 1) << RF_FPGA_FREQ_CW_4_POS)
#define RF_FPGA_FREQ_CW_4_UMSK  (~(((1U << RF_FPGA_FREQ_CW_4_LEN) - 1) << RF_FPGA_FREQ_CW_4_POS))

/* 0x6E8 : rf_fpga_table_50 */
#define RF_FPGA_TABLE_50_OFFSET (0x6E8)
#define RF_FPGA_FREQ_CW_11      RF_FPGA_FREQ_CW_11
#define RF_FPGA_FREQ_CW_11_POS  (0U)
#define RF_FPGA_FREQ_CW_11_LEN  (7U)
#define RF_FPGA_FREQ_CW_11_MSK  (((1U << RF_FPGA_FREQ_CW_11_LEN) - 1) << RF_FPGA_FREQ_CW_11_POS)
#define RF_FPGA_FREQ_CW_11_UMSK (~(((1U << RF_FPGA_FREQ_CW_11_LEN) - 1) << RF_FPGA_FREQ_CW_11_POS))
#define RF_FPGA_FREQ_CW_10      RF_FPGA_FREQ_CW_10
#define RF_FPGA_FREQ_CW_10_POS  (8U)
#define RF_FPGA_FREQ_CW_10_LEN  (7U)
#define RF_FPGA_FREQ_CW_10_MSK  (((1U << RF_FPGA_FREQ_CW_10_LEN) - 1) << RF_FPGA_FREQ_CW_10_POS)
#define RF_FPGA_FREQ_CW_10_UMSK (~(((1U << RF_FPGA_FREQ_CW_10_LEN) - 1) << RF_FPGA_FREQ_CW_10_POS))
#define RF_FPGA_FREQ_CW_9       RF_FPGA_FREQ_CW_9
#define RF_FPGA_FREQ_CW_9_POS   (16U)
#define RF_FPGA_FREQ_CW_9_LEN   (7U)
#define RF_FPGA_FREQ_CW_9_MSK   (((1U << RF_FPGA_FREQ_CW_9_LEN) - 1) << RF_FPGA_FREQ_CW_9_POS)
#define RF_FPGA_FREQ_CW_9_UMSK  (~(((1U << RF_FPGA_FREQ_CW_9_LEN) - 1) << RF_FPGA_FREQ_CW_9_POS))
#define RF_FPGA_FREQ_CW_8       RF_FPGA_FREQ_CW_8
#define RF_FPGA_FREQ_CW_8_POS   (24U)
#define RF_FPGA_FREQ_CW_8_LEN   (7U)
#define RF_FPGA_FREQ_CW_8_MSK   (((1U << RF_FPGA_FREQ_CW_8_LEN) - 1) << RF_FPGA_FREQ_CW_8_POS)
#define RF_FPGA_FREQ_CW_8_UMSK  (~(((1U << RF_FPGA_FREQ_CW_8_LEN) - 1) << RF_FPGA_FREQ_CW_8_POS))

/* 0x6EC : rf_fpga_table_51 */
#define RF_FPGA_TABLE_51_OFFSET (0x6EC)
#define RF_FPGA_FREQ_CW_15      RF_FPGA_FREQ_CW_15
#define RF_FPGA_FREQ_CW_15_POS  (0U)
#define RF_FPGA_FREQ_CW_15_LEN  (7U)
#define RF_FPGA_FREQ_CW_15_MSK  (((1U << RF_FPGA_FREQ_CW_15_LEN) - 1) << RF_FPGA_FREQ_CW_15_POS)
#define RF_FPGA_FREQ_CW_15_UMSK (~(((1U << RF_FPGA_FREQ_CW_15_LEN) - 1) << RF_FPGA_FREQ_CW_15_POS))
#define RF_FPGA_FREQ_CW_14      RF_FPGA_FREQ_CW_14
#define RF_FPGA_FREQ_CW_14_POS  (8U)
#define RF_FPGA_FREQ_CW_14_LEN  (7U)
#define RF_FPGA_FREQ_CW_14_MSK  (((1U << RF_FPGA_FREQ_CW_14_LEN) - 1) << RF_FPGA_FREQ_CW_14_POS)
#define RF_FPGA_FREQ_CW_14_UMSK (~(((1U << RF_FPGA_FREQ_CW_14_LEN) - 1) << RF_FPGA_FREQ_CW_14_POS))
#define RF_FPGA_FREQ_CW_13      RF_FPGA_FREQ_CW_13
#define RF_FPGA_FREQ_CW_13_POS  (16U)
#define RF_FPGA_FREQ_CW_13_LEN  (7U)
#define RF_FPGA_FREQ_CW_13_MSK  (((1U << RF_FPGA_FREQ_CW_13_LEN) - 1) << RF_FPGA_FREQ_CW_13_POS)
#define RF_FPGA_FREQ_CW_13_UMSK (~(((1U << RF_FPGA_FREQ_CW_13_LEN) - 1) << RF_FPGA_FREQ_CW_13_POS))
#define RF_FPGA_FREQ_CW_12      RF_FPGA_FREQ_CW_12
#define RF_FPGA_FREQ_CW_12_POS  (24U)
#define RF_FPGA_FREQ_CW_12_LEN  (7U)
#define RF_FPGA_FREQ_CW_12_MSK  (((1U << RF_FPGA_FREQ_CW_12_LEN) - 1) << RF_FPGA_FREQ_CW_12_POS)
#define RF_FPGA_FREQ_CW_12_UMSK (~(((1U << RF_FPGA_FREQ_CW_12_LEN) - 1) << RF_FPGA_FREQ_CW_12_POS))

/* 0x6F0 : rf_fpga_table_52 */
#define RF_FPGA_TABLE_52_OFFSET (0x6F0)
#define RF_FPGA_FREQ_CW_19      RF_FPGA_FREQ_CW_19
#define RF_FPGA_FREQ_CW_19_POS  (0U)
#define RF_FPGA_FREQ_CW_19_LEN  (7U)
#define RF_FPGA_FREQ_CW_19_MSK  (((1U << RF_FPGA_FREQ_CW_19_LEN) - 1) << RF_FPGA_FREQ_CW_19_POS)
#define RF_FPGA_FREQ_CW_19_UMSK (~(((1U << RF_FPGA_FREQ_CW_19_LEN) - 1) << RF_FPGA_FREQ_CW_19_POS))
#define RF_FPGA_FREQ_CW_18      RF_FPGA_FREQ_CW_18
#define RF_FPGA_FREQ_CW_18_POS  (8U)
#define RF_FPGA_FREQ_CW_18_LEN  (7U)
#define RF_FPGA_FREQ_CW_18_MSK  (((1U << RF_FPGA_FREQ_CW_18_LEN) - 1) << RF_FPGA_FREQ_CW_18_POS)
#define RF_FPGA_FREQ_CW_18_UMSK (~(((1U << RF_FPGA_FREQ_CW_18_LEN) - 1) << RF_FPGA_FREQ_CW_18_POS))
#define RF_FPGA_FREQ_CW_17      RF_FPGA_FREQ_CW_17
#define RF_FPGA_FREQ_CW_17_POS  (16U)
#define RF_FPGA_FREQ_CW_17_LEN  (7U)
#define RF_FPGA_FREQ_CW_17_MSK  (((1U << RF_FPGA_FREQ_CW_17_LEN) - 1) << RF_FPGA_FREQ_CW_17_POS)
#define RF_FPGA_FREQ_CW_17_UMSK (~(((1U << RF_FPGA_FREQ_CW_17_LEN) - 1) << RF_FPGA_FREQ_CW_17_POS))
#define RF_FPGA_FREQ_CW_16      RF_FPGA_FREQ_CW_16
#define RF_FPGA_FREQ_CW_16_POS  (24U)
#define RF_FPGA_FREQ_CW_16_LEN  (7U)
#define RF_FPGA_FREQ_CW_16_MSK  (((1U << RF_FPGA_FREQ_CW_16_LEN) - 1) << RF_FPGA_FREQ_CW_16_POS)
#define RF_FPGA_FREQ_CW_16_UMSK (~(((1U << RF_FPGA_FREQ_CW_16_LEN) - 1) << RF_FPGA_FREQ_CW_16_POS))

/* 0x6F4 : rf_fpga_table_53 */
#define RF_FPGA_TABLE_53_OFFSET (0x6F4)
#define RF_FPGA_FREQ_CW_23      RF_FPGA_FREQ_CW_23
#define RF_FPGA_FREQ_CW_23_POS  (0U)
#define RF_FPGA_FREQ_CW_23_LEN  (7U)
#define RF_FPGA_FREQ_CW_23_MSK  (((1U << RF_FPGA_FREQ_CW_23_LEN) - 1) << RF_FPGA_FREQ_CW_23_POS)
#define RF_FPGA_FREQ_CW_23_UMSK (~(((1U << RF_FPGA_FREQ_CW_23_LEN) - 1) << RF_FPGA_FREQ_CW_23_POS))
#define RF_FPGA_FREQ_CW_22      RF_FPGA_FREQ_CW_22
#define RF_FPGA_FREQ_CW_22_POS  (8U)
#define RF_FPGA_FREQ_CW_22_LEN  (7U)
#define RF_FPGA_FREQ_CW_22_MSK  (((1U << RF_FPGA_FREQ_CW_22_LEN) - 1) << RF_FPGA_FREQ_CW_22_POS)
#define RF_FPGA_FREQ_CW_22_UMSK (~(((1U << RF_FPGA_FREQ_CW_22_LEN) - 1) << RF_FPGA_FREQ_CW_22_POS))
#define RF_FPGA_FREQ_CW_21      RF_FPGA_FREQ_CW_21
#define RF_FPGA_FREQ_CW_21_POS  (16U)
#define RF_FPGA_FREQ_CW_21_LEN  (7U)
#define RF_FPGA_FREQ_CW_21_MSK  (((1U << RF_FPGA_FREQ_CW_21_LEN) - 1) << RF_FPGA_FREQ_CW_21_POS)
#define RF_FPGA_FREQ_CW_21_UMSK (~(((1U << RF_FPGA_FREQ_CW_21_LEN) - 1) << RF_FPGA_FREQ_CW_21_POS))
#define RF_FPGA_FREQ_CW_20      RF_FPGA_FREQ_CW_20
#define RF_FPGA_FREQ_CW_20_POS  (24U)
#define RF_FPGA_FREQ_CW_20_LEN  (7U)
#define RF_FPGA_FREQ_CW_20_MSK  (((1U << RF_FPGA_FREQ_CW_20_LEN) - 1) << RF_FPGA_FREQ_CW_20_POS)
#define RF_FPGA_FREQ_CW_20_UMSK (~(((1U << RF_FPGA_FREQ_CW_20_LEN) - 1) << RF_FPGA_FREQ_CW_20_POS))

/* 0x6F8 : rf_fpga_table_54 */
#define RF_FPGA_TABLE_54_OFFSET (0x6F8)
#define RF_FPGA_FREQ_CW_27      RF_FPGA_FREQ_CW_27
#define RF_FPGA_FREQ_CW_27_POS  (0U)
#define RF_FPGA_FREQ_CW_27_LEN  (7U)
#define RF_FPGA_FREQ_CW_27_MSK  (((1U << RF_FPGA_FREQ_CW_27_LEN) - 1) << RF_FPGA_FREQ_CW_27_POS)
#define RF_FPGA_FREQ_CW_27_UMSK (~(((1U << RF_FPGA_FREQ_CW_27_LEN) - 1) << RF_FPGA_FREQ_CW_27_POS))
#define RF_FPGA_FREQ_CW_26      RF_FPGA_FREQ_CW_26
#define RF_FPGA_FREQ_CW_26_POS  (8U)
#define RF_FPGA_FREQ_CW_26_LEN  (7U)
#define RF_FPGA_FREQ_CW_26_MSK  (((1U << RF_FPGA_FREQ_CW_26_LEN) - 1) << RF_FPGA_FREQ_CW_26_POS)
#define RF_FPGA_FREQ_CW_26_UMSK (~(((1U << RF_FPGA_FREQ_CW_26_LEN) - 1) << RF_FPGA_FREQ_CW_26_POS))
#define RF_FPGA_FREQ_CW_25      RF_FPGA_FREQ_CW_25
#define RF_FPGA_FREQ_CW_25_POS  (16U)
#define RF_FPGA_FREQ_CW_25_LEN  (7U)
#define RF_FPGA_FREQ_CW_25_MSK  (((1U << RF_FPGA_FREQ_CW_25_LEN) - 1) << RF_FPGA_FREQ_CW_25_POS)
#define RF_FPGA_FREQ_CW_25_UMSK (~(((1U << RF_FPGA_FREQ_CW_25_LEN) - 1) << RF_FPGA_FREQ_CW_25_POS))
#define RF_FPGA_FREQ_CW_24      RF_FPGA_FREQ_CW_24
#define RF_FPGA_FREQ_CW_24_POS  (24U)
#define RF_FPGA_FREQ_CW_24_LEN  (7U)
#define RF_FPGA_FREQ_CW_24_MSK  (((1U << RF_FPGA_FREQ_CW_24_LEN) - 1) << RF_FPGA_FREQ_CW_24_POS)
#define RF_FPGA_FREQ_CW_24_UMSK (~(((1U << RF_FPGA_FREQ_CW_24_LEN) - 1) << RF_FPGA_FREQ_CW_24_POS))

