bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_fpga_reg.h
/* 0x6FC : rf_fpga_table_55 */
#define RF_FPGA_TABLE_55_OFFSET (0x6FC)
#define RF_FPGA_FREQ_CW_31      RF_FPGA_FREQ_CW_31
#define RF_FPGA_FREQ_CW_31_POS  (0U)
#define RF_FPGA_FREQ_CW_31_LEN  (7U)
#define RF_FPGA_FREQ_CW_31_MSK  (((1U << RF_FPGA_FREQ_CW_31_LEN) - 1) << RF_FPGA_FREQ_CW_31_POS)
#define RF_FPGA_FREQ_CW_31_UMSK (~(((1U << RF_FPGA_FREQ_CW_31_LEN) - 1) << RF_FPGA_FREQ_CW_31_POS))
#define RF_FPGA_FREQ_CW_30      RF_FPGA_FREQ_CW_30
#define RF_FPGA_FREQ_CW_30_POS  (8U)
#define RF_FPGA_FREQ_CW_30_LEN  (7U)
#define RF_FPGA_FREQ_CW_30_MSK  (((1U << RF_FPGA_FREQ_CW_30_LEN) - 1) << RF_FPGA_FREQ_CW_30_POS)
#define RF_FPGA_FREQ_CW_30_UMSK (~(((1U << RF_FPGA_FREQ_CW_30_LEN) - 1) << RF_FPGA_FREQ_CW_30_POS))
#define RF_FPGA_FREQ_CW_29      RF_FPGA_FREQ_CW_29
#define RF_FPGA_FREQ_CW_29_POS  (16U)
#define RF_FPGA_FREQ_CW_29_LEN  (7U)
#define RF_FPGA_FREQ_CW_29_MSK  (((1U << RF_FPGA_FREQ_CW_29_LEN) - 1) << RF_FPGA_FREQ_CW_29_POS)
#define RF_FPGA_FREQ_CW_29_UMSK (~(((1U << RF_FPGA_FREQ_CW_29_LEN) - 1) << RF_FPGA_FREQ_CW_29_POS))
#define RF_FPGA_FREQ_CW_28      RF_FPGA_FREQ_CW_28
#define RF_FPGA_FREQ_CW_28_POS  (24U)
#define RF_FPGA_FREQ_CW_28_LEN  (7U)
#define RF_FPGA_FREQ_CW_28_MSK  (((1U << RF_FPGA_FREQ_CW_28_LEN) - 1) << RF_FPGA_FREQ_CW_28_POS)
#define RF_FPGA_FREQ_CW_28_UMSK (~(((1U << RF_FPGA_FREQ_CW_28_LEN) - 1) << RF_FPGA_FREQ_CW_28_POS))

/* 0x700 : rf_fpga_table_56 */
#define RF_FPGA_TABLE_56_OFFSET (0x700)
#define RF_FPGA_FREQ_CW_35      RF_FPGA_FREQ_CW_35
#define RF_FPGA_FREQ_CW_35_POS  (0U)
#define RF_FPGA_FREQ_CW_35_LEN  (7U)
#define RF_FPGA_FREQ_CW_35_MSK  (((1U << RF_FPGA_FREQ_CW_35_LEN) - 1) << RF_FPGA_FREQ_CW_35_POS)
#define RF_FPGA_FREQ_CW_35_UMSK (~(((1U << RF_FPGA_FREQ_CW_35_LEN) - 1) << RF_FPGA_FREQ_CW_35_POS))
#define RF_FPGA_FREQ_CW_34      RF_FPGA_FREQ_CW_34
#define RF_FPGA_FREQ_CW_34_POS  (8U)
#define RF_FPGA_FREQ_CW_34_LEN  (7U)
#define RF_FPGA_FREQ_CW_34_MSK  (((1U << RF_FPGA_FREQ_CW_34_LEN) - 1) << RF_FPGA_FREQ_CW_34_POS)
#define RF_FPGA_FREQ_CW_34_UMSK (~(((1U << RF_FPGA_FREQ_CW_34_LEN) - 1) << RF_FPGA_FREQ_CW_34_POS))
#define RF_FPGA_FREQ_CW_33      RF_FPGA_FREQ_CW_33
#define RF_FPGA_FREQ_CW_33_POS  (16U)
#define RF_FPGA_FREQ_CW_33_LEN  (7U)
#define RF_FPGA_FREQ_CW_33_MSK  (((1U << RF_FPGA_FREQ_CW_33_LEN) - 1) << RF_FPGA_FREQ_CW_33_POS)
#define RF_FPGA_FREQ_CW_33_UMSK (~(((1U << RF_FPGA_FREQ_CW_33_LEN) - 1) << RF_FPGA_FREQ_CW_33_POS))
#define RF_FPGA_FREQ_CW_32      RF_FPGA_FREQ_CW_32
#define RF_FPGA_FREQ_CW_32_POS  (24U)
#define RF_FPGA_FREQ_CW_32_LEN  (7U)
#define RF_FPGA_FREQ_CW_32_MSK  (((1U << RF_FPGA_FREQ_CW_32_LEN) - 1) << RF_FPGA_FREQ_CW_32_POS)
#define RF_FPGA_FREQ_CW_32_UMSK (~(((1U << RF_FPGA_FREQ_CW_32_LEN) - 1) << RF_FPGA_FREQ_CW_32_POS))

/* 0x704 : rf_fpga_table_57 */
#define RF_FPGA_TABLE_57_OFFSET (0x704)
#define RF_FPGA_FREQ_CW_39      RF_FPGA_FREQ_CW_39
#define RF_FPGA_FREQ_CW_39_POS  (0U)
#define RF_FPGA_FREQ_CW_39_LEN  (7U)
#define RF_FPGA_FREQ_CW_39_MSK  (((1U << RF_FPGA_FREQ_CW_39_LEN) - 1) << RF_FPGA_FREQ_CW_39_POS)
#define RF_FPGA_FREQ_CW_39_UMSK (~(((1U << RF_FPGA_FREQ_CW_39_LEN) - 1) << RF_FPGA_FREQ_CW_39_POS))
#define RF_FPGA_FREQ_CW_38      RF_FPGA_FREQ_CW_38
#define RF_FPGA_FREQ_CW_38_POS  (8U)
#define RF_FPGA_FREQ_CW_38_LEN  (7U)
#define RF_FPGA_FREQ_CW_38_MSK  (((1U << RF_FPGA_FREQ_CW_38_LEN) - 1) << RF_FPGA_FREQ_CW_38_POS)
#define RF_FPGA_FREQ_CW_38_UMSK (~(((1U << RF_FPGA_FREQ_CW_38_LEN) - 1) << RF_FPGA_FREQ_CW_38_POS))
#define RF_FPGA_FREQ_CW_37      RF_FPGA_FREQ_CW_37
#define RF_FPGA_FREQ_CW_37_POS  (16U)
#define RF_FPGA_FREQ_CW_37_LEN  (7U)
#define RF_FPGA_FREQ_CW_37_MSK  (((1U << RF_FPGA_FREQ_CW_37_LEN) - 1) << RF_FPGA_FREQ_CW_37_POS)
#define RF_FPGA_FREQ_CW_37_UMSK (~(((1U << RF_FPGA_FREQ_CW_37_LEN) - 1) << RF_FPGA_FREQ_CW_37_POS))
#define RF_FPGA_FREQ_CW_36      RF_FPGA_FREQ_CW_36
#define RF_FPGA_FREQ_CW_36_POS  (24U)
#define RF_FPGA_FREQ_CW_36_LEN  (7U)
#define RF_FPGA_FREQ_CW_36_MSK  (((1U << RF_FPGA_FREQ_CW_36_LEN) - 1) << RF_FPGA_FREQ_CW_36_POS)
#define RF_FPGA_FREQ_CW_36_UMSK (~(((1U << RF_FPGA_FREQ_CW_36_LEN) - 1) << RF_FPGA_FREQ_CW_36_POS))

/* 0x708 : rf_fpga_table_58 */
#define RF_FPGA_TABLE_58_OFFSET (0x708)
#define RF_FPGA_FREQ_CW_43      RF_FPGA_FREQ_CW_43
#define RF_FPGA_FREQ_CW_43_POS  (0U)
#define RF_FPGA_FREQ_CW_43_LEN  (7U)
#define RF_FPGA_FREQ_CW_43_MSK  (((1U << RF_FPGA_FREQ_CW_43_LEN) - 1) << RF_FPGA_FREQ_CW_43_POS)
#define RF_FPGA_FREQ_CW_43_UMSK (~(((1U << RF_FPGA_FREQ_CW_43_LEN) - 1) << RF_FPGA_FREQ_CW_43_POS))
#define RF_FPGA_FREQ_CW_42      RF_FPGA_FREQ_CW_42
#define RF_FPGA_FREQ_CW_42_POS  (8U)
#define RF_FPGA_FREQ_CW_42_LEN  (7U)
#define RF_FPGA_FREQ_CW_42_MSK  (((1U << RF_FPGA_FREQ_CW_42_LEN) - 1) << RF_FPGA_FREQ_CW_42_POS)
#define RF_FPGA_FREQ_CW_42_UMSK (~(((1U << RF_FPGA_FREQ_CW_42_LEN) - 1) << RF_FPGA_FREQ_CW_42_POS))
#define RF_FPGA_FREQ_CW_41      RF_FPGA_FREQ_CW_41
#define RF_FPGA_FREQ_CW_41_POS  (16U)
#define RF_FPGA_FREQ_CW_41_LEN  (7U)
#define RF_FPGA_FREQ_CW_41_MSK  (((1U << RF_FPGA_FREQ_CW_41_LEN) - 1) << RF_FPGA_FREQ_CW_41_POS)
#define RF_FPGA_FREQ_CW_41_UMSK (~(((1U << RF_FPGA_FREQ_CW_41_LEN) - 1) << RF_FPGA_FREQ_CW_41_POS))
#define RF_FPGA_FREQ_CW_40      RF_FPGA_FREQ_CW_40
#define RF_FPGA_FREQ_CW_40_POS  (24U)
#define RF_FPGA_FREQ_CW_40_LEN  (7U)
#define RF_FPGA_FREQ_CW_40_MSK  (((1U << RF_FPGA_FREQ_CW_40_LEN) - 1) << RF_FPGA_FREQ_CW_40_POS)
#define RF_FPGA_FREQ_CW_40_UMSK (~(((1U << RF_FPGA_FREQ_CW_40_LEN) - 1) << RF_FPGA_FREQ_CW_40_POS))

/* 0x70C : rf_fpga_table_59 */
#define RF_FPGA_TABLE_59_OFFSET (0x70C)
#define RF_FPGA_FREQ_CW_47      RF_FPGA_FREQ_CW_47
#define RF_FPGA_FREQ_CW_47_POS  (0U)
#define RF_FPGA_FREQ_CW_47_LEN  (7U)
#define RF_FPGA_FREQ_CW_47_MSK  (((1U << RF_FPGA_FREQ_CW_47_LEN) - 1) << RF_FPGA_FREQ_CW_47_POS)
#define RF_FPGA_FREQ_CW_47_UMSK (~(((1U << RF_FPGA_FREQ_CW_47_LEN) - 1) << RF_FPGA_FREQ_CW_47_POS))
#define RF_FPGA_FREQ_CW_46      RF_FPGA_FREQ_CW_46
#define RF_FPGA_FREQ_CW_46_POS  (8U)
#define RF_FPGA_FREQ_CW_46_LEN  (7U)
#define RF_FPGA_FREQ_CW_46_MSK  (((1U << RF_FPGA_FREQ_CW_46_LEN) - 1) << RF_FPGA_FREQ_CW_46_POS)
#define RF_FPGA_FREQ_CW_46_UMSK (~(((1U << RF_FPGA_FREQ_CW_46_LEN) - 1) << RF_FPGA_FREQ_CW_46_POS))
#define RF_FPGA_FREQ_CW_45      RF_FPGA_FREQ_CW_45
#define RF_FPGA_FREQ_CW_45_POS  (16U)
#define RF_FPGA_FREQ_CW_45_LEN  (7U)
#define RF_FPGA_FREQ_CW_45_MSK  (((1U << RF_FPGA_FREQ_CW_45_LEN) - 1) << RF_FPGA_FREQ_CW_45_POS)
#define RF_FPGA_FREQ_CW_45_UMSK (~(((1U << RF_FPGA_FREQ_CW_45_LEN) - 1) << RF_FPGA_FREQ_CW_45_POS))
#define RF_FPGA_FREQ_CW_44      RF_FPGA_FREQ_CW_44
#define RF_FPGA_FREQ_CW_44_POS  (24U)
#define RF_FPGA_FREQ_CW_44_LEN  (7U)
#define RF_FPGA_FREQ_CW_44_MSK  (((1U << RF_FPGA_FREQ_CW_44_LEN) - 1) << RF_FPGA_FREQ_CW_44_POS)
#define RF_FPGA_FREQ_CW_44_UMSK (~(((1U << RF_FPGA_FREQ_CW_44_LEN) - 1) << RF_FPGA_FREQ_CW_44_POS))

/* 0x710 : rf_fpga_ctrl_8 */
#define RF_FPGA_CTRL_8_OFFSET   (0x710)
#define RF_FPGA_CMD_ENABLE      RF_FPGA_CMD_ENABLE
#define RF_FPGA_CMD_ENABLE_POS  (0U)
#define RF_FPGA_CMD_ENABLE_LEN  (16U)
#define RF_FPGA_CMD_ENABLE_MSK  (((1U << RF_FPGA_CMD_ENABLE_LEN) - 1) << RF_FPGA_CMD_ENABLE_POS)
#define RF_FPGA_CMD_ENABLE_UMSK (~(((1U << RF_FPGA_CMD_ENABLE_LEN) - 1) << RF_FPGA_CMD_ENABLE_POS))

/* 0x714 : rf_fpga_table_60 */
#define RF_FPGA_TABLE_60_OFFSET   (0x714)
#define RF_FPGA_FREQ_CW_RX_3      RF_FPGA_FREQ_CW_RX_3
#define RF_FPGA_FREQ_CW_RX_3_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_3_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_3_MSK  (((1U << RF_FPGA_FREQ_CW_RX_3_LEN) - 1) << RF_FPGA_FREQ_CW_RX_3_POS)
#define RF_FPGA_FREQ_CW_RX_3_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_3_LEN) - 1) << RF_FPGA_FREQ_CW_RX_3_POS))
#define RF_FPGA_FREQ_CW_RX_2      RF_FPGA_FREQ_CW_RX_2
#define RF_FPGA_FREQ_CW_RX_2_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_2_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_2_MSK  (((1U << RF_FPGA_FREQ_CW_RX_2_LEN) - 1) << RF_FPGA_FREQ_CW_RX_2_POS)
#define RF_FPGA_FREQ_CW_RX_2_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_2_LEN) - 1) << RF_FPGA_FREQ_CW_RX_2_POS))
#define RF_FPGA_FREQ_CW_RX_1      RF_FPGA_FREQ_CW_RX_1
#define RF_FPGA_FREQ_CW_RX_1_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_1_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_1_MSK  (((1U << RF_FPGA_FREQ_CW_RX_1_LEN) - 1) << RF_FPGA_FREQ_CW_RX_1_POS)
#define RF_FPGA_FREQ_CW_RX_1_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_1_LEN) - 1) << RF_FPGA_FREQ_CW_RX_1_POS))
#define RF_FPGA_FREQ_CW_RX_0      RF_FPGA_FREQ_CW_RX_0
#define RF_FPGA_FREQ_CW_RX_0_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_0_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_0_MSK  (((1U << RF_FPGA_FREQ_CW_RX_0_LEN) - 1) << RF_FPGA_FREQ_CW_RX_0_POS)
#define RF_FPGA_FREQ_CW_RX_0_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_0_LEN) - 1) << RF_FPGA_FREQ_CW_RX_0_POS))

/* 0x718 : rf_fpga_table_61 */
#define RF_FPGA_TABLE_61_OFFSET   (0x718)
#define RF_FPGA_FREQ_CW_RX_7      RF_FPGA_FREQ_CW_RX_7
#define RF_FPGA_FREQ_CW_RX_7_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_7_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_7_MSK  (((1U << RF_FPGA_FREQ_CW_RX_7_LEN) - 1) << RF_FPGA_FREQ_CW_RX_7_POS)
#define RF_FPGA_FREQ_CW_RX_7_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_7_LEN) - 1) << RF_FPGA_FREQ_CW_RX_7_POS))
#define RF_FPGA_FREQ_CW_RX_6      RF_FPGA_FREQ_CW_RX_6
#define RF_FPGA_FREQ_CW_RX_6_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_6_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_6_MSK  (((1U << RF_FPGA_FREQ_CW_RX_6_LEN) - 1) << RF_FPGA_FREQ_CW_RX_6_POS)
#define RF_FPGA_FREQ_CW_RX_6_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_6_LEN) - 1) << RF_FPGA_FREQ_CW_RX_6_POS))
#define RF_FPGA_FREQ_CW_RX_5      RF_FPGA_FREQ_CW_RX_5
#define RF_FPGA_FREQ_CW_RX_5_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_5_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_5_MSK  (((1U << RF_FPGA_FREQ_CW_RX_5_LEN) - 1) << RF_FPGA_FREQ_CW_RX_5_POS)
#define RF_FPGA_FREQ_CW_RX_5_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_5_LEN) - 1) << RF_FPGA_FREQ_CW_RX_5_POS))
#define RF_FPGA_FREQ_CW_RX_4      RF_FPGA_FREQ_CW_RX_4
#define RF_FPGA_FREQ_CW_RX_4_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_4_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_4_MSK  (((1U << RF_FPGA_FREQ_CW_RX_4_LEN) - 1) << RF_FPGA_FREQ_CW_RX_4_POS)
#define RF_FPGA_FREQ_CW_RX_4_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_4_LEN) - 1) << RF_FPGA_FREQ_CW_RX_4_POS))

/* 0x71C : rf_fpga_table_62 */
#define RF_FPGA_TABLE_62_OFFSET    (0x71C)
#define RF_FPGA_FREQ_CW_RX_11      RF_FPGA_FREQ_CW_RX_11
#define RF_FPGA_FREQ_CW_RX_11_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_11_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_11_MSK  (((1U << RF_FPGA_FREQ_CW_RX_11_LEN) - 1) << RF_FPGA_FREQ_CW_RX_11_POS)
#define RF_FPGA_FREQ_CW_RX_11_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_11_LEN) - 1) << RF_FPGA_FREQ_CW_RX_11_POS))
#define RF_FPGA_FREQ_CW_RX_10      RF_FPGA_FREQ_CW_RX_10
#define RF_FPGA_FREQ_CW_RX_10_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_10_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_10_MSK  (((1U << RF_FPGA_FREQ_CW_RX_10_LEN) - 1) << RF_FPGA_FREQ_CW_RX_10_POS)
#define RF_FPGA_FREQ_CW_RX_10_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_10_LEN) - 1) << RF_FPGA_FREQ_CW_RX_10_POS))
#define RF_FPGA_FREQ_CW_RX_9       RF_FPGA_FREQ_CW_RX_9
#define RF_FPGA_FREQ_CW_RX_9_POS   (16U)
#define RF_FPGA_FREQ_CW_RX_9_LEN   (7U)
#define RF_FPGA_FREQ_CW_RX_9_MSK   (((1U << RF_FPGA_FREQ_CW_RX_9_LEN) - 1) << RF_FPGA_FREQ_CW_RX_9_POS)
#define RF_FPGA_FREQ_CW_RX_9_UMSK  (~(((1U << RF_FPGA_FREQ_CW_RX_9_LEN) - 1) << RF_FPGA_FREQ_CW_RX_9_POS))
#define RF_FPGA_FREQ_CW_RX_8       RF_FPGA_FREQ_CW_RX_8
#define RF_FPGA_FREQ_CW_RX_8_POS   (24U)
#define RF_FPGA_FREQ_CW_RX_8_LEN   (7U)
#define RF_FPGA_FREQ_CW_RX_8_MSK   (((1U << RF_FPGA_FREQ_CW_RX_8_LEN) - 1) << RF_FPGA_FREQ_CW_RX_8_POS)
#define RF_FPGA_FREQ_CW_RX_8_UMSK  (~(((1U << RF_FPGA_FREQ_CW_RX_8_LEN) - 1) << RF_FPGA_FREQ_CW_RX_8_POS))

/* 0x720 : rf_fpga_table_63 */
#define RF_FPGA_TABLE_63_OFFSET    (0x720)
#define RF_FPGA_FREQ_CW_RX_15      RF_FPGA_FREQ_CW_RX_15
#define RF_FPGA_FREQ_CW_RX_15_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_15_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_15_MSK  (((1U << RF_FPGA_FREQ_CW_RX_15_LEN) - 1) << RF_FPGA_FREQ_CW_RX_15_POS)
#define RF_FPGA_FREQ_CW_RX_15_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_15_LEN) - 1) << RF_FPGA_FREQ_CW_RX_15_POS))
#define RF_FPGA_FREQ_CW_RX_14      RF_FPGA_FREQ_CW_RX_14
#define RF_FPGA_FREQ_CW_RX_14_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_14_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_14_MSK  (((1U << RF_FPGA_FREQ_CW_RX_14_LEN) - 1) << RF_FPGA_FREQ_CW_RX_14_POS)
#define RF_FPGA_FREQ_CW_RX_14_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_14_LEN) - 1) << RF_FPGA_FREQ_CW_RX_14_POS))
#define RF_FPGA_FREQ_CW_RX_13      RF_FPGA_FREQ_CW_RX_13
#define RF_FPGA_FREQ_CW_RX_13_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_13_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_13_MSK  (((1U << RF_FPGA_FREQ_CW_RX_13_LEN) - 1) << RF_FPGA_FREQ_CW_RX_13_POS)
#define RF_FPGA_FREQ_CW_RX_13_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_13_LEN) - 1) << RF_FPGA_FREQ_CW_RX_13_POS))
#define RF_FPGA_FREQ_CW_RX_12      RF_FPGA_FREQ_CW_RX_12
#define RF_FPGA_FREQ_CW_RX_12_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_12_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_12_MSK  (((1U << RF_FPGA_FREQ_CW_RX_12_LEN) - 1) << RF_FPGA_FREQ_CW_RX_12_POS)
#define RF_FPGA_FREQ_CW_RX_12_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_12_LEN) - 1) << RF_FPGA_FREQ_CW_RX_12_POS))

