bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_fpga_reg.h
/* 0x724 : rf_fpga_table_64 */
#define RF_FPGA_TABLE_64_OFFSET    (0x724)
#define RF_FPGA_FREQ_CW_RX_19      RF_FPGA_FREQ_CW_RX_19
#define RF_FPGA_FREQ_CW_RX_19_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_19_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_19_MSK  (((1U << RF_FPGA_FREQ_CW_RX_19_LEN) - 1) << RF_FPGA_FREQ_CW_RX_19_POS)
#define RF_FPGA_FREQ_CW_RX_19_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_19_LEN) - 1) << RF_FPGA_FREQ_CW_RX_19_POS))
#define RF_FPGA_FREQ_CW_RX_18      RF_FPGA_FREQ_CW_RX_18
#define RF_FPGA_FREQ_CW_RX_18_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_18_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_18_MSK  (((1U << RF_FPGA_FREQ_CW_RX_18_LEN) - 1) << RF_FPGA_FREQ_CW_RX_18_POS)
#define RF_FPGA_FREQ_CW_RX_18_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_18_LEN) - 1) << RF_FPGA_FREQ_CW_RX_18_POS))
#define RF_FPGA_FREQ_CW_RX_17      RF_FPGA_FREQ_CW_RX_17
#define RF_FPGA_FREQ_CW_RX_17_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_17_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_17_MSK  (((1U << RF_FPGA_FREQ_CW_RX_17_LEN) - 1) << RF_FPGA_FREQ_CW_RX_17_POS)
#define RF_FPGA_FREQ_CW_RX_17_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_17_LEN) - 1) << RF_FPGA_FREQ_CW_RX_17_POS))
#define RF_FPGA_FREQ_CW_RX_16      RF_FPGA_FREQ_CW_RX_16
#define RF_FPGA_FREQ_CW_RX_16_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_16_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_16_MSK  (((1U << RF_FPGA_FREQ_CW_RX_16_LEN) - 1) << RF_FPGA_FREQ_CW_RX_16_POS)
#define RF_FPGA_FREQ_CW_RX_16_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_16_LEN) - 1) << RF_FPGA_FREQ_CW_RX_16_POS))

/* 0x728 : rf_fpga_table_65 */
#define RF_FPGA_TABLE_65_OFFSET    (0x728)
#define RF_FPGA_FREQ_CW_RX_23      RF_FPGA_FREQ_CW_RX_23
#define RF_FPGA_FREQ_CW_RX_23_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_23_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_23_MSK  (((1U << RF_FPGA_FREQ_CW_RX_23_LEN) - 1) << RF_FPGA_FREQ_CW_RX_23_POS)
#define RF_FPGA_FREQ_CW_RX_23_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_23_LEN) - 1) << RF_FPGA_FREQ_CW_RX_23_POS))
#define RF_FPGA_FREQ_CW_RX_22      RF_FPGA_FREQ_CW_RX_22
#define RF_FPGA_FREQ_CW_RX_22_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_22_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_22_MSK  (((1U << RF_FPGA_FREQ_CW_RX_22_LEN) - 1) << RF_FPGA_FREQ_CW_RX_22_POS)
#define RF_FPGA_FREQ_CW_RX_22_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_22_LEN) - 1) << RF_FPGA_FREQ_CW_RX_22_POS))
#define RF_FPGA_FREQ_CW_RX_21      RF_FPGA_FREQ_CW_RX_21
#define RF_FPGA_FREQ_CW_RX_21_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_21_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_21_MSK  (((1U << RF_FPGA_FREQ_CW_RX_21_LEN) - 1) << RF_FPGA_FREQ_CW_RX_21_POS)
#define RF_FPGA_FREQ_CW_RX_21_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_21_LEN) - 1) << RF_FPGA_FREQ_CW_RX_21_POS))
#define RF_FPGA_FREQ_CW_RX_20      RF_FPGA_FREQ_CW_RX_20
#define RF_FPGA_FREQ_CW_RX_20_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_20_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_20_MSK  (((1U << RF_FPGA_FREQ_CW_RX_20_LEN) - 1) << RF_FPGA_FREQ_CW_RX_20_POS)
#define RF_FPGA_FREQ_CW_RX_20_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_20_LEN) - 1) << RF_FPGA_FREQ_CW_RX_20_POS))

/* 0x72C : rf_fpga_table_66 */
#define RF_FPGA_TABLE_66_OFFSET    (0x72C)
#define RF_FPGA_FREQ_CW_RX_27      RF_FPGA_FREQ_CW_RX_27
#define RF_FPGA_FREQ_CW_RX_27_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_27_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_27_MSK  (((1U << RF_FPGA_FREQ_CW_RX_27_LEN) - 1) << RF_FPGA_FREQ_CW_RX_27_POS)
#define RF_FPGA_FREQ_CW_RX_27_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_27_LEN) - 1) << RF_FPGA_FREQ_CW_RX_27_POS))
#define RF_FPGA_FREQ_CW_RX_26      RF_FPGA_FREQ_CW_RX_26
#define RF_FPGA_FREQ_CW_RX_26_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_26_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_26_MSK  (((1U << RF_FPGA_FREQ_CW_RX_26_LEN) - 1) << RF_FPGA_FREQ_CW_RX_26_POS)
#define RF_FPGA_FREQ_CW_RX_26_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_26_LEN) - 1) << RF_FPGA_FREQ_CW_RX_26_POS))
#define RF_FPGA_FREQ_CW_RX_25      RF_FPGA_FREQ_CW_RX_25
#define RF_FPGA_FREQ_CW_RX_25_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_25_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_25_MSK  (((1U << RF_FPGA_FREQ_CW_RX_25_LEN) - 1) << RF_FPGA_FREQ_CW_RX_25_POS)
#define RF_FPGA_FREQ_CW_RX_25_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_25_LEN) - 1) << RF_FPGA_FREQ_CW_RX_25_POS))
#define RF_FPGA_FREQ_CW_RX_24      RF_FPGA_FREQ_CW_RX_24
#define RF_FPGA_FREQ_CW_RX_24_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_24_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_24_MSK  (((1U << RF_FPGA_FREQ_CW_RX_24_LEN) - 1) << RF_FPGA_FREQ_CW_RX_24_POS)
#define RF_FPGA_FREQ_CW_RX_24_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_24_LEN) - 1) << RF_FPGA_FREQ_CW_RX_24_POS))

/* 0x730 : rf_fpga_table_67 */
#define RF_FPGA_TABLE_67_OFFSET    (0x730)
#define RF_FPGA_FREQ_CW_RX_31      RF_FPGA_FREQ_CW_RX_31
#define RF_FPGA_FREQ_CW_RX_31_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_31_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_31_MSK  (((1U << RF_FPGA_FREQ_CW_RX_31_LEN) - 1) << RF_FPGA_FREQ_CW_RX_31_POS)
#define RF_FPGA_FREQ_CW_RX_31_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_31_LEN) - 1) << RF_FPGA_FREQ_CW_RX_31_POS))
#define RF_FPGA_FREQ_CW_RX_30      RF_FPGA_FREQ_CW_RX_30
#define RF_FPGA_FREQ_CW_RX_30_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_30_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_30_MSK  (((1U << RF_FPGA_FREQ_CW_RX_30_LEN) - 1) << RF_FPGA_FREQ_CW_RX_30_POS)
#define RF_FPGA_FREQ_CW_RX_30_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_30_LEN) - 1) << RF_FPGA_FREQ_CW_RX_30_POS))
#define RF_FPGA_FREQ_CW_RX_29      RF_FPGA_FREQ_CW_RX_29
#define RF_FPGA_FREQ_CW_RX_29_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_29_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_29_MSK  (((1U << RF_FPGA_FREQ_CW_RX_29_LEN) - 1) << RF_FPGA_FREQ_CW_RX_29_POS)
#define RF_FPGA_FREQ_CW_RX_29_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_29_LEN) - 1) << RF_FPGA_FREQ_CW_RX_29_POS))
#define RF_FPGA_FREQ_CW_RX_28      RF_FPGA_FREQ_CW_RX_28
#define RF_FPGA_FREQ_CW_RX_28_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_28_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_28_MSK  (((1U << RF_FPGA_FREQ_CW_RX_28_LEN) - 1) << RF_FPGA_FREQ_CW_RX_28_POS)
#define RF_FPGA_FREQ_CW_RX_28_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_28_LEN) - 1) << RF_FPGA_FREQ_CW_RX_28_POS))

/* 0x734 : rf_fpga_table_68 */
#define RF_FPGA_TABLE_68_OFFSET    (0x734)
#define RF_FPGA_FREQ_CW_RX_35      RF_FPGA_FREQ_CW_RX_35
#define RF_FPGA_FREQ_CW_RX_35_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_35_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_35_MSK  (((1U << RF_FPGA_FREQ_CW_RX_35_LEN) - 1) << RF_FPGA_FREQ_CW_RX_35_POS)
#define RF_FPGA_FREQ_CW_RX_35_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_35_LEN) - 1) << RF_FPGA_FREQ_CW_RX_35_POS))
#define RF_FPGA_FREQ_CW_RX_34      RF_FPGA_FREQ_CW_RX_34
#define RF_FPGA_FREQ_CW_RX_34_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_34_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_34_MSK  (((1U << RF_FPGA_FREQ_CW_RX_34_LEN) - 1) << RF_FPGA_FREQ_CW_RX_34_POS)
#define RF_FPGA_FREQ_CW_RX_34_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_34_LEN) - 1) << RF_FPGA_FREQ_CW_RX_34_POS))
#define RF_FPGA_FREQ_CW_RX_33      RF_FPGA_FREQ_CW_RX_33
#define RF_FPGA_FREQ_CW_RX_33_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_33_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_33_MSK  (((1U << RF_FPGA_FREQ_CW_RX_33_LEN) - 1) << RF_FPGA_FREQ_CW_RX_33_POS)
#define RF_FPGA_FREQ_CW_RX_33_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_33_LEN) - 1) << RF_FPGA_FREQ_CW_RX_33_POS))
#define RF_FPGA_FREQ_CW_RX_32      RF_FPGA_FREQ_CW_RX_32
#define RF_FPGA_FREQ_CW_RX_32_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_32_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_32_MSK  (((1U << RF_FPGA_FREQ_CW_RX_32_LEN) - 1) << RF_FPGA_FREQ_CW_RX_32_POS)
#define RF_FPGA_FREQ_CW_RX_32_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_32_LEN) - 1) << RF_FPGA_FREQ_CW_RX_32_POS))

/* 0x738 : rf_fpga_table_69 */
#define RF_FPGA_TABLE_69_OFFSET    (0x738)
#define RF_FPGA_FREQ_CW_RX_39      RF_FPGA_FREQ_CW_RX_39
#define RF_FPGA_FREQ_CW_RX_39_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_39_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_39_MSK  (((1U << RF_FPGA_FREQ_CW_RX_39_LEN) - 1) << RF_FPGA_FREQ_CW_RX_39_POS)
#define RF_FPGA_FREQ_CW_RX_39_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_39_LEN) - 1) << RF_FPGA_FREQ_CW_RX_39_POS))
#define RF_FPGA_FREQ_CW_RX_38      RF_FPGA_FREQ_CW_RX_38
#define RF_FPGA_FREQ_CW_RX_38_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_38_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_38_MSK  (((1U << RF_FPGA_FREQ_CW_RX_38_LEN) - 1) << RF_FPGA_FREQ_CW_RX_38_POS)
#define RF_FPGA_FREQ_CW_RX_38_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_38_LEN) - 1) << RF_FPGA_FREQ_CW_RX_38_POS))
#define RF_FPGA_FREQ_CW_RX_37      RF_FPGA_FREQ_CW_RX_37
#define RF_FPGA_FREQ_CW_RX_37_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_37_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_37_MSK  (((1U << RF_FPGA_FREQ_CW_RX_37_LEN) - 1) << RF_FPGA_FREQ_CW_RX_37_POS)
#define RF_FPGA_FREQ_CW_RX_37_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_37_LEN) - 1) << RF_FPGA_FREQ_CW_RX_37_POS))
#define RF_FPGA_FREQ_CW_RX_36      RF_FPGA_FREQ_CW_RX_36
#define RF_FPGA_FREQ_CW_RX_36_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_36_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_36_MSK  (((1U << RF_FPGA_FREQ_CW_RX_36_LEN) - 1) << RF_FPGA_FREQ_CW_RX_36_POS)
#define RF_FPGA_FREQ_CW_RX_36_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_36_LEN) - 1) << RF_FPGA_FREQ_CW_RX_36_POS))

/* 0x73C : rf_fpga_table_70 */
#define RF_FPGA_TABLE_70_OFFSET    (0x73C)
#define RF_FPGA_FREQ_CW_RX_43      RF_FPGA_FREQ_CW_RX_43
#define RF_FPGA_FREQ_CW_RX_43_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_43_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_43_MSK  (((1U << RF_FPGA_FREQ_CW_RX_43_LEN) - 1) << RF_FPGA_FREQ_CW_RX_43_POS)
#define RF_FPGA_FREQ_CW_RX_43_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_43_LEN) - 1) << RF_FPGA_FREQ_CW_RX_43_POS))
#define RF_FPGA_FREQ_CW_RX_42      RF_FPGA_FREQ_CW_RX_42
#define RF_FPGA_FREQ_CW_RX_42_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_42_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_42_MSK  (((1U << RF_FPGA_FREQ_CW_RX_42_LEN) - 1) << RF_FPGA_FREQ_CW_RX_42_POS)
#define RF_FPGA_FREQ_CW_RX_42_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_42_LEN) - 1) << RF_FPGA_FREQ_CW_RX_42_POS))
#define RF_FPGA_FREQ_CW_RX_41      RF_FPGA_FREQ_CW_RX_41
#define RF_FPGA_FREQ_CW_RX_41_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_41_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_41_MSK  (((1U << RF_FPGA_FREQ_CW_RX_41_LEN) - 1) << RF_FPGA_FREQ_CW_RX_41_POS)
#define RF_FPGA_FREQ_CW_RX_41_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_41_LEN) - 1) << RF_FPGA_FREQ_CW_RX_41_POS))
#define RF_FPGA_FREQ_CW_RX_40      RF_FPGA_FREQ_CW_RX_40
#define RF_FPGA_FREQ_CW_RX_40_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_40_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_40_MSK  (((1U << RF_FPGA_FREQ_CW_RX_40_LEN) - 1) << RF_FPGA_FREQ_CW_RX_40_POS)
#define RF_FPGA_FREQ_CW_RX_40_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_40_LEN) - 1) << RF_FPGA_FREQ_CW_RX_40_POS))

/* 0x740 : rf_fpga_table_71 */
#define RF_FPGA_TABLE_71_OFFSET    (0x740)
#define RF_FPGA_FREQ_CW_RX_47      RF_FPGA_FREQ_CW_RX_47
#define RF_FPGA_FREQ_CW_RX_47_POS  (0U)
#define RF_FPGA_FREQ_CW_RX_47_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_47_MSK  (((1U << RF_FPGA_FREQ_CW_RX_47_LEN) - 1) << RF_FPGA_FREQ_CW_RX_47_POS)
#define RF_FPGA_FREQ_CW_RX_47_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_47_LEN) - 1) << RF_FPGA_FREQ_CW_RX_47_POS))
#define RF_FPGA_FREQ_CW_RX_46      RF_FPGA_FREQ_CW_RX_46
#define RF_FPGA_FREQ_CW_RX_46_POS  (8U)
#define RF_FPGA_FREQ_CW_RX_46_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_46_MSK  (((1U << RF_FPGA_FREQ_CW_RX_46_LEN) - 1) << RF_FPGA_FREQ_CW_RX_46_POS)
#define RF_FPGA_FREQ_CW_RX_46_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_46_LEN) - 1) << RF_FPGA_FREQ_CW_RX_46_POS))
#define RF_FPGA_FREQ_CW_RX_45      RF_FPGA_FREQ_CW_RX_45
#define RF_FPGA_FREQ_CW_RX_45_POS  (16U)
#define RF_FPGA_FREQ_CW_RX_45_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_45_MSK  (((1U << RF_FPGA_FREQ_CW_RX_45_LEN) - 1) << RF_FPGA_FREQ_CW_RX_45_POS)
#define RF_FPGA_FREQ_CW_RX_45_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_45_LEN) - 1) << RF_FPGA_FREQ_CW_RX_45_POS))
#define RF_FPGA_FREQ_CW_RX_44      RF_FPGA_FREQ_CW_RX_44
#define RF_FPGA_FREQ_CW_RX_44_POS  (24U)
#define RF_FPGA_FREQ_CW_RX_44_LEN  (7U)
#define RF_FPGA_FREQ_CW_RX_44_MSK  (((1U << RF_FPGA_FREQ_CW_RX_44_LEN) - 1) << RF_FPGA_FREQ_CW_RX_44_POS)
#define RF_FPGA_FREQ_CW_RX_44_UMSK (~(((1U << RF_FPGA_FREQ_CW_RX_44_LEN) - 1) << RF_FPGA_FREQ_CW_RX_44_POS))

struct rf_fpga_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[1536];

    /* 0x600 : rf_fpga_ctrl_0 */
    union {
        struct
        {
            uint32_t rf_fsm_st_cci_4s    : 5;  /* [ 4: 0],        r/w,        0x0 */
            uint32_t rf_fsm_st_cci_4s_en : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_15       : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t rf_fsm_en           : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_22      : 6;  /* [22:17],       rsvd,        0x0 */
            uint32_t rf_fsm_state_cci    : 5;  /* [27:23],          r,        0x0 */
            uint32_t rf_fsm_pu_rx_en     : 1;  /* [   28],        r/w,        0x1 */
            uint32_t rf_fsm_pu_tx_en     : 1;  /* [   29],        r/w,        0x1 */
            uint32_t rf_fsm_pu_lo_en     : 1;  /* [   30],        r/w,        0x1 */
            uint32_t rf_fsm_pu_sb_en     : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_ctrl_0;

    /* 0x604 : rf_fpga_ctrl_1 */
    union {
        struct
        {
            uint32_t rf_fsm_cci_wr_time : 12; /* [11: 0],        r/w,       0x4a */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t rf_fsm_lo_time     : 12; /* [27:16],        r/w,      0x640 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_ctrl_1;

