bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_fpga_reg.h
    /* 0x608 : rf_fpga_ctrl_2 */
    union {
        struct
        {
            uint32_t rf_fsm_dly_30_time : 12; /* [11: 0],        r/w,      0x294 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t rf_fsm_dly_01_time : 12; /* [27:16],        r/w,       0x20 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_ctrl_2;

    /* 0x60C : rf_fpga_ctrl_3 */
    union {
        struct
        {
            uint32_t rf_fsm_pu_sb : 32; /* [31: 0],        r/w, 0xd0000077L */
        } BF;
        uint32_t WORD;
    } rf_fpga_ctrl_3;

    /* 0x610 : rf_fpga_ctrl_4 */
    union {
        struct
        {
            uint32_t rf_fsm_pu_lo : 32; /* [31: 0],        r/w, 0xd3f00077L */
        } BF;
        uint32_t WORD;
    } rf_fpga_ctrl_4;

    /* 0x614 : rf_fpga_ctrl_5 */
    union {
        struct
        {
            uint32_t rf_fsm_pu_tx : 32; /* [31: 0],        r/w, 0xfbff0077L */
        } BF;
        uint32_t WORD;
    } rf_fpga_ctrl_5;

    /* 0x618 : rf_fpga_ctrl_6 */
    union {
        struct
        {
            uint32_t rf_fsm_pu_rx : 32; /* [31: 0],        r/w, 0xc7f07ff7L */
        } BF;
        uint32_t WORD;
    } rf_fpga_ctrl_6;

    /* 0x61C : rf_fpga_ctrl_7 */
    union {
        struct
        {
            uint32_t reserved_0_20  : 21; /* [20: 0],       rsvd,        0x0 */
            uint32_t idac_cw_0      : 5;  /* [25:21],        r/w,        0xf */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_ctrl_7;

    /* 0x620 : rf_fpga_table_0 */
    union {
        struct
        {
            uint32_t sdmin_0        : 30; /* [29: 0],        r/w, 0x14d9c71c */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_0;

    /* 0x624 : rf_fpga_table_1 */
    union {
        struct
        {
            uint32_t sdmin_1        : 30; /* [29: 0],        r/w, 0x14de38e3 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_1;

    /* 0x628 : rf_fpga_table_2 */
    union {
        struct
        {
            uint32_t sdmin_2        : 30; /* [29: 0],        r/w, 0x14e2aaaa */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_2;

    /* 0x62C : rf_fpga_table_3 */
    union {
        struct
        {
            uint32_t sdmin_3        : 30; /* [29: 0],        r/w, 0x14e71c71 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_3;

    /* 0x630 : rf_fpga_table_4 */
    union {
        struct
        {
            uint32_t sdmin_4        : 30; /* [29: 0],        r/w, 0x14eb8e38 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_4;

    /* 0x634 : rf_fpga_table_5 */
    union {
        struct
        {
            uint32_t sdmin_5        : 30; /* [29: 0],        r/w, 0x14f00000 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_5;

    /* 0x638 : rf_fpga_table_6 */
    union {
        struct
        {
            uint32_t sdmin_6        : 30; /* [29: 0],        r/w, 0x14f471c7 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_6;

    /* 0x63C : rf_fpga_table_7 */
    union {
        struct
        {
            uint32_t sdmin_7        : 30; /* [29: 0],        r/w, 0x14f8e38e */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_7;

    /* 0x640 : rf_fpga_table_8 */
    union {
        struct
        {
            uint32_t sdmin_8        : 30; /* [29: 0],        r/w, 0x14fd5555 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_8;

    /* 0x644 : rf_fpga_table_9 */
    union {
        struct
        {
            uint32_t sdmin_9        : 30; /* [29: 0],        r/w, 0x1501c71c */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_9;

    /* 0x648 : rf_fpga_table_10 */
    union {
        struct
        {
            uint32_t sdmin_10       : 30; /* [29: 0],        r/w, 0x150638e3 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_10;

    /* 0x64C : rf_fpga_table_11 */
    union {
        struct
        {
            uint32_t sdmin_11       : 30; /* [29: 0],        r/w, 0x150aaaaa */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_11;

    /* 0x650 : rf_fpga_table_12 */
    union {
        struct
        {
            uint32_t sdmin_12       : 30; /* [29: 0],        r/w, 0x150f1c71 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_12;

    /* 0x654 : rf_fpga_table_13 */
    union {
        struct
        {
            uint32_t sdmin_13       : 30; /* [29: 0],        r/w, 0x15138e38 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_13;

    /* 0x658 : rf_fpga_table_14 */
    union {
        struct
        {
            uint32_t sdmin_14       : 30; /* [29: 0],        r/w, 0x15180000 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_14;

    /* 0x65C : rf_fpga_table_15 */
    union {
        struct
        {
            uint32_t sdmin_15       : 30; /* [29: 0],        r/w, 0x151c71c7 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_15;

    /* 0x660 : rf_fpga_table_16 */
    union {
        struct
        {
            uint32_t sdmin_16       : 30; /* [29: 0],        r/w, 0x1520e38e */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_16;

    /* 0x664 : rf_fpga_table_17 */
    union {
        struct
        {
            uint32_t sdmin_17       : 30; /* [29: 0],        r/w, 0x15255555 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_17;

