bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_fpga_reg.h
    /* 0x6CC : rf_fpga_table_43 */
    union {
        struct
        {
            uint32_t sdmin_43       : 30; /* [29: 0],        r/w, 0x15231c71 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_43;

    /* 0x6D0 : rf_fpga_table_44 */
    union {
        struct
        {
            uint32_t sdmin_44       : 30; /* [29: 0],        r/w, 0x15395555 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_44;

    /* 0x6D4 : rf_fpga_table_45 */
    union {
        struct
        {
            uint32_t sdmin_45       : 30; /* [29: 0],        r/w, 0x154f8e38 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_45;

    /* 0x6D8 : rf_fpga_table_46 */
    union {
        struct
        {
            uint32_t sdmin_46       : 30; /* [29: 0],        r/w, 0x1565c71c */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_46;

    /* 0x6DC : rf_fpga_table_47 */
    union {
        struct
        {
            uint32_t sdmin_47       : 30; /* [29: 0],        r/w, 0x157c0000 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_47;

    /* 0x6E0 : rf_fpga_table_48 */
    union {
        struct
        {
            uint32_t freq_cw_3   : 7; /* [ 6: 0],        r/w,       0x29 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_2   : 7; /* [14: 8],        r/w,       0x29 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_1   : 7; /* [22:16],        r/w,       0x29 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_0   : 7; /* [30:24],        r/w,       0x2a */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_48;

    /* 0x6E4 : rf_fpga_table_49 */
    union {
        struct
        {
            uint32_t freq_cw_7   : 7; /* [ 6: 0],        r/w,       0x28 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_6   : 7; /* [14: 8],        r/w,       0x28 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_5   : 7; /* [22:16],        r/w,       0x28 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_4   : 7; /* [30:24],        r/w,       0x29 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_49;

    /* 0x6E8 : rf_fpga_table_50 */
    union {
        struct
        {
            uint32_t freq_cw_11  : 7; /* [ 6: 0],        r/w,       0x27 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_10  : 7; /* [14: 8],        r/w,       0x27 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_9   : 7; /* [22:16],        r/w,       0x27 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_8   : 7; /* [30:24],        r/w,       0x27 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_50;

    /* 0x6EC : rf_fpga_table_51 */
    union {
        struct
        {
            uint32_t freq_cw_15  : 7; /* [ 6: 0],        r/w,       0x25 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_14  : 7; /* [14: 8],        r/w,       0x26 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_13  : 7; /* [22:16],        r/w,       0x26 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_12  : 7; /* [30:24],        r/w,       0x26 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_51;

    /* 0x6F0 : rf_fpga_table_52 */
    union {
        struct
        {
            uint32_t freq_cw_19  : 7; /* [ 6: 0],        r/w,       0x24 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_18  : 7; /* [14: 8],        r/w,       0x25 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_17  : 7; /* [22:16],        r/w,       0x25 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_16  : 7; /* [30:24],        r/w,       0x25 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_52;

    /* 0x6F4 : rf_fpga_table_53 */
    union {
        struct
        {
            uint32_t freq_cw_23  : 7; /* [ 6: 0],        r/w,       0x23 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_22  : 7; /* [14: 8],        r/w,       0x24 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_21  : 7; /* [22:16],        r/w,       0x24 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_20  : 7; /* [30:24],        r/w,       0x24 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_53;

    /* 0x6F8 : rf_fpga_table_54 */
    union {
        struct
        {
            uint32_t freq_cw_27  : 7; /* [ 6: 0],        r/w,       0x22 */
            uint32_t reserved_7  : 1; /* [    7],       rsvd,        0x0 */
            uint32_t freq_cw_26  : 7; /* [14: 8],        r/w,       0x22 */
            uint32_t reserved_15 : 1; /* [   15],       rsvd,        0x0 */
            uint32_t freq_cw_25  : 7; /* [22:16],        r/w,       0x23 */
            uint32_t reserved_23 : 1; /* [   23],       rsvd,        0x0 */
            uint32_t freq_cw_24  : 7; /* [30:24],        r/w,       0x23 */
            uint32_t reserved_31 : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fpga_table_54;

